/*
	NPC Name: 		Spinel
	Map(s): 		Victoria Road : Henesys (100000000), Victoria Road : Ellinia (101000000), Victoria Road : Perion (102000000), Victoria Road : Kerning City (103000000), Victoria Road : Lith Harbor (104000000), Orbis : Orbis (200000000), Ludibrium : Ludibrium (220000000), Leafre : Leafre (240000000), Zipangu : Mushroom Shrine (800000000)
	Description: 		World Tour Guide
*/
var status = -1;
var sel;
var togo1;
var map;

//-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

function start() {
	switch (cm.getMapId()) {
		case 200000000: //天空之城1
		case 211000000: //冰原雪域2
			map = cm.getSavedLoccation("Worldtour");
			cm.sendSimple("想到處旅遊嗎?找我就對了，哈哈!!想去哪呢?還是要回去原來的地方? \n\r #b#L0#我想去~#l \n\r #L1#我旅行完了,我要回去#m"+map+"##l");
			break;
	}
}

//-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
function action(mode, type, selection) {
	if (mode == -1) { 
		cm.dispose();
	}else {
		if((status <= 2 && mode == 0)) || (status == 4 && mode == 1)) {
			cm.dispose;
			return;
		}
	}
//-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
	if (mode == 1)
		status++;
	else
		status--;
//-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
	if (status == 0) {
		if (selection == 0) {
			switch (cm.getMapId()) {
				case 200000000:
					togo1 = 211000000;
				case 211000000:
					togo1 = 200000000;
				break;
			}
			cm.sendSimple("想去哪呢? \n\r #b#L0##m"+togo1+"# (3,000 楓幣)#l");
		}else if (selection == 1){
				cm.warp(map);
				cm.clearSavedLocation("Worldtour");
				cm.dispose();
		}
	}else if (status == 1) {
			sel = selection;
			if (sel == 0 ) {
				cm.sendNext("你確定要前往 #b#m"+togo1+"##k?  到那邊需要 #b3,000 楓幣#k. 確定現在要去嗎?");
			}
		}else if (status == 2) {
			if (sel == 0 ) {
				cm.warp(togo1);
			}
		    cm.dispose();
		}
	}
}
				